---
type: WallSweepInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 19
tags: [revit-api, class]
---

# WallSweepInfo

`Autodesk.Revit.DB.WallSweepInfo` · Revit 2024 · 19 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | WallSweepInfo | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsEqual | 2012 | `public bool IsEqual ( WallSweepInfo toCompare )` |
| Property | CutsWall | 2012 | `public bool CutsWall { get ; set ; }` |
| Property | DefaultSetback | 2012 | `public double DefaultSetback { get ; set ; }` |
| Property | Distance | 2012 | `public double Distance { get ; set ; }` |
| Property | DistanceMeasuredFrom | 2012 | `public DistanceMeasuredFrom DistanceMeasuredFrom { get ; set ; }` |
| Property | Id | 2012 | `public int Id { get ; set ; }` |
| Property | IsCutByInserts | 2012 | `public bool IsCutByInserts { get ; set ; }` |
| Property | IsFixed | 2012 | `public bool IsFixed { get ; }` |
| Property | IsProfileFlipped | 2012 | `public bool IsProfileFlipped { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | IsVertical | 2012 | `public bool IsVertical { get ; }` |
| Property | MaterialId | 2012 | `public ElementId MaterialId { get ; set ; }` |
| Property | ProfileId | 2012 | `public ElementId ProfileId { get ; set ; }` |
| Property | WallOffset | 2012 | `public double WallOffset { get ; set ; }` |
| Property | WallSide | 2012 | `public WallSide WallSide { get ; set ; }` |
| Property | WallSweepOrientation | 2012 | `public WallSweepOrientation WallSweepOrientation { get ; set ; }` |
| Property | WallSweepType | 2012 | `public WallSweepType WallSweepType { get ; set ; }` |